RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dbi.c
/**
  ******************************************************************************
  * @file    bl808_dbi.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl808_dbi.h"

/** @addtogroup  BL808_Peripheral_Driver
 *  @{
 */

/** @addtogroup  DBI
 *  @{
 */

/** @defgroup  DBI_Private_Macros
 *  @{
 */

/*@} end of group DBI_Private_Macros */

/** @defgroup  DBI_Private_Types
 *  @{
 */

/*@} end of group DBI_Private_Types */

/** @defgroup  DBI_Private_Variables
 *  @{
 */

/**
 *  @brief DBI interrupt callback function address array
 */
#ifndef BFLB_USE_HAL_DRIVER
static intCallback_Type *DBIIntCbfArra[DBI_INT_ALL] = {
    NULL
};
#endif

/*@} end of group DBI_Private_Variables */

/** @defgroup  DBI_Global_Variables
 *  @{
 */

/*@} end of group DBI_Global_Variables */

/** @defgroup  DBI_Private_Fun_Declaration
 *  @{
 */

/*@} end of group DBI_Private_Fun_Declaration */

/** @defgroup  DBI_Private_Functions
 *  @{
 */

/*@} end of group DBI_Private_Functions */

/** @defgroup  DBI_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  DBI interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DBI_IRQHandler(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DBI_BASE, DBI_INT_STS);

    /* DBI transfer end interrupt */
    if (BL_IS_REG_BIT_SET(tmpVal, DBI_END_INT) && !BL_IS_REG_BIT_SET(tmpVal, DBI_CR_DBI_END_MASK)) {
        BL_WR_REG(DBI_BASE, DBI_INT_STS, BL_SET_REG_BIT(tmpVal, DBI_CR_DBI_END_CLR));

        if (DBIIntCbfArra[DBI_INT_END] != NULL) {
            DBIIntCbfArra[DBI_INT_END]();
        }
    }

    /* DBI tx fifo ready interrupt */
    if (BL_IS_REG_BIT_SET(tmpVal, DBI_TXF_INT) && !BL_IS_REG_BIT_SET(tmpVal, DBI_CR_DBI_TXF_MASK)) {
        if (DBIIntCbfArra[DBI_INT_TX_FIFO_REQ] != NULL) {
            DBIIntCbfArra[DBI_INT_TX_FIFO_REQ]();
        }
    }

    /* DBI tx fifo ready interrupt */
    if (BL_IS_REG_BIT_SET(tmpVal, DBI_FER_INT) && !BL_IS_REG_BIT_SET(tmpVal, DBI_CR_DBI_FER_MASK)) {
        if (DBIIntCbfArra[DBI_INT_FIFO_ERR] != NULL) {
            DBIIntCbfArra[DBI_INT_FIFO_ERR]();
        }
    }
}
#endif

/****************************************************************************/ /**
 * @brief  DBI init
 *
 * @param  dbiCfg: DBI configuration
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type DBI_Init(DBI_CFG_Type *dbiCfg)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_DBI_MODE_TYPE(dbiCfg->mode));
    CHECK_PARAM(IS_DBI_PIXEL_FORMAT_TYPE(dbiCfg->pixelFormat));
    CHECK_PARAM(IS_DBI_FIFO_FORMAT_TYPE(dbiCfg->fifoFormat));
    CHECK_PARAM(IS_DBI_SCL_CLK_PHASE_TYPE(dbiCfg->clkPhase));
    CHECK_PARAM(IS_DBI_SCL_CLK_POLARITY_TYPE(dbiCfg->clkPolarity));

    tmpVal = BL_RD_REG(DBI_BASE, DBI_CONFIG);

    /* Select DBI type B or C */
    if (dbiCfg->mode == DBI_TYPE_B) {
        tmpVal = BL_CLR_REG_BIT(tmpVal, DBI_CR_DBI_SEL);
    } else if (dbiCfg->mode == DBI_TYPE_C_3_WIRE) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DBI_CR_DBI_SEL);
        tmpVal = BL_SET_REG_BIT(tmpVal, DBI_CR_DBI_TC_3W_MODE);
    } else {
        tmpVal = BL_SET_REG_BIT(tmpVal, DBI_CR_DBI_SEL);
        tmpVal = BL_CLR_REG_BIT(tmpVal, DBI_CR_DBI_TC_3W_MODE);
    }

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_CONT_EN, dbiCfg->continueEn);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_DMY_EN, dbiCfg->dummyEn);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_DMY_CNT, dbiCfg->dummyCnt);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_SCL_PH, dbiCfg->clkPhase);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_SCL_POL, dbiCfg->clkPolarity);

    BL_WR_REG(DBI_BASE, DBI_CONFIG, tmpVal);

    /* Set data period */
    DBI_SetPeriod(&(dbiCfg->period));

    /* Set pixel format */
    tmpVal = BL_RD_REG(DBI_BASE, DBI_PIX_CNT);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_PIX_FORMAT, dbiCfg->pixelFormat);
    BL_WR_REG(DBI_BASE, DBI_PIX_CNT, tmpVal);

    /* Set fifo format */
    tmpVal = BL_RD_REG(DBI_BASE, DBI_FIFO_CONFIG_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_FIFO_FORMAT, dbiCfg->fifoFormat);
    BL_WR_REG(DBI_BASE, DBI_FIFO_CONFIG_0, tmpVal);

