RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dbi.c
#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(DBI_IRQn, DBI_IRQHandler);
#endif

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DBI command and data configuration
 *
 * @param  cdCfg: Pointer of DBI CD configure type
 *
 * @return None
 *
*******************************************************************************/
void DBI_CDConfig(DBI_CD_CFG_Type *cdCfg)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_DBI_DATA_TYPE(cdCfg->dataType));
    CHECK_PARAM(IS_DBI_DATA_DIRECTION_TYPE(cdCfg->dataDir));

    /* Set command and data comfiguration */
    tmpVal = BL_RD_REG(DBI_BASE, DBI_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_CMD_EN, cdCfg->commandEn);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_CMD, cdCfg->command);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_DAT_EN, cdCfg->dataEn);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_DAT_TP, cdCfg->dataType);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_DAT_WR, cdCfg->dataDir);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_DAT_BC, cdCfg->dataCnt);
    BL_WR_REG(DBI_BASE, DBI_CONFIG, tmpVal);
    BL_WR_REG(DBI_BASE, DBI_WDATA, cdCfg->data);
}

/****************************************************************************/ /**
 * @brief  DBI enable
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void DBI_Enable(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DBI_BASE, DBI_CONFIG);
    BL_WR_REG(DBI_BASE, DBI_CONFIG, BL_SET_REG_BIT(tmpVal, DBI_CR_DBI_EN));
}

/****************************************************************************/ /**
 * @brief  DBI disable
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void DBI_Disable(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DBI_BASE, DBI_CONFIG);
    BL_WR_REG(DBI_BASE, DBI_CONFIG, BL_CLR_REG_BIT(tmpVal, DBI_CR_DBI_EN));
}

/****************************************************************************/ /**
 * @brief  DBI enable
 *
 * @param  period: DBI period configuration
 *
 * @return None
 *
*******************************************************************************/
void DBI_SetPeriod(DBI_Period_CFG_Type *period)
{
    uint32_t tmpVal;

    /* Set data period */
    tmpVal = BL_RD_REG(DBI_BASE, DBI_PRD);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_PRD_S, period->startLen);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_PRD_D_PH_0, period->dataPhase0Len);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_PRD_D_PH_1, period->dataPhase1Len);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_PRD_I, period->intervalLen);

    BL_WR_REG(DBI_BASE, DBI_PRD, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DBI set Command
 *
 * @param  Command:  start Command (frist byte)
 * @return None
 *
*******************************************************************************/
void DBI_SetCommand(uint8_t Command )
{
    uint32_t tmpVal;

    /* Set command */
    tmpVal = BL_RD_REG(DBI_BASE, DBI_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_CMD, Command);
    BL_WR_REG(DBI_BASE, DBI_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DBI set Command and Data enable signal
 *
 * @param  CommandEn:  DISABLE:No command phase, ENABLE:Command will be sent
 * @param  dataEn:     DISABLE:No data phase,    ENABLE:data will be sent
 * @return None
 *
*******************************************************************************/
void DBI_SetPhaseState(BL_Fun_Type commandEn, BL_Fun_Type dataEn)
{
    uint32_t tmpVal;

    /* Set command */
    tmpVal = BL_RD_REG(DBI_BASE, DBI_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_CMD_EN, commandEn);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_DAT_EN, dataEn);
    BL_WR_REG(DBI_BASE, DBI_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DBI set Data type and count, Automatically change data phase settings
 *
 * @param  datatype:  Data type select
 * @param  dataCount: count of data (Not the size of the data)
 *                    normal data: max 4
 * @return None
 *
*******************************************************************************/
void DBI_SetDataTypeAndCount(DBI_Data_Type dataType, uint32_t dataCount)
{
    uint32_t tmpVal, tmpVal2;

    /* Set dbi config */
    tmpVal = BL_RD_REG(DBI_BASE, DBI_CONFIG);
    /* Set data type */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_DAT_TP, dataType);

    if(!dataCount){
        /* No data phase */
        tmpVal = BL_CLR_REG_BIT(tmpVal, DBI_CR_DBI_DAT_EN);
    }else{
        /* data will be sent */
        tmpVal = BL_SET_REG_BIT(tmpVal, DBI_CR_DBI_DAT_EN);

        if(dataType == DBI_DATA_NORMAL){
            if(dataCount > 4){
                dataCount = 4;
            }
            /* data byte count of normal-data */
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_DAT_BC, dataCount-1);
        }else{
            /* pixel count of pixel-data */
            tmpVal2 = BL_RD_REG(DBI_BASE, DBI_PIX_CNT);
            tmpVal2 = BL_SET_REG_BITS_VAL(tmpVal2, DBI_CR_DBI_PIX_CNT, dataCount-1);
            BL_WR_REG(DBI_BASE, DBI_PIX_CNT, tmpVal2);
        }
    }
    BL_WR_REG(DBI_BASE, DBI_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DBI set normal data direction (It only works in normal data)
 *
 * @param  dataDir:  write or read
 * @return None
 *
*******************************************************************************/
void DBI_SetNormalDataDir(DBI_Data_Direction_Type dataDir)
{
    uint32_t tmpVal;
    /* Set dbi config */
    tmpVal = BL_RD_REG(DBI_BASE, DBI_CONFIG);
    /* set normal data direction */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_DAT_WR, dataDir);
    BL_WR_REG(DBI_BASE, DBI_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DBI Read Norml-Data from rdata-register
 *
 * @param  dataSize:  size of data (max 4-byte)
 * @param  dataBuff:  buff of data
 * @return None
 *
*******************************************************************************/
void DBI_ReadNormlData(uint8_t dataSize, uint8_t *dataBuff)
{
    if(dataSize > 4){
        dataSize = 4;
    }

    /* get receive data from registers*/
    uint32_t para_data = 0;
    para_data = BL_RD_REG(DBI_BASE, DBI_RDATA);

