RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dbi.c
    /* copy to buff */
    memcpy(dataBuff, &para_data, dataSize);
}

/****************************************************************************/ /**
 * @brief  DBI Write Norml-Data to rdata-register
 *
 * @param  dataSize:  size of data (max 4-byte)
 * @param  dataBuff:  buff of data
 * @return None
 *
*******************************************************************************/
void DBI_WriteNormlData(uint8_t dataSize, uint8_t *dataBuff)
{
    uint32_t para_data = 0;

    if(dataSize > 4){
        dataSize = 4;
    }

    for(uint8_t i=0; i<dataSize; i++){
        ((uint8_t *)(&para_data))[dataSize-i-1] = dataBuff[i];
    }

    BL_WR_REG(DBI_BASE, DBI_WDATA, para_data);
}

/****************************************************************************/ /**
 * @brief  DBI Wirte Data to FIFO.
 *    You should have configured Data byte count(normal or pixel) before,
 *    And the transfer has been started.
 *    note : The sum of data Count must be for the configured Count(normal or pixel),
 *           Before the next transmission, you should wait for send done.
 *
 * @param  wordCount: the WordsCount of data (Not data count)
 * @param  pixelBuff: buff of data
 * @return None
 *
*******************************************************************************/
void DBI_WirteData2FIFO(uint32_t wordCount, uint32_t *dataBuff)
{
    for(uint32_t i = 0; i < wordCount; ){
        if (DBI_GetTxFifoCount() > 0) {
            BL_WR_REG(DBI_BASE, DBI_FIFO_WDATA, dataBuff[i++]);
        }
    }
}

/****************************************************************************/ /**
 * @brief  DBI Calculate the WordCount of data in different pixel formats
 *          You should have configured the FIFO-format before
 * @param  PixelCount: pixel count
 * @return Words Count
 *
*******************************************************************************/
uint32_t DBI_GetWordCountOfPixelData(int32_t PixelCount)
{
    uint32_t wordCount;
    /* get pixel-formats of fifo*/
    DBI_FIFO_Format_Type fifoFormat = BL_GET_REG_BITS_VAL(BL_RD_REG(DBI_BASE, DBI_FIFO_CONFIG_0), DBI_FIFO_FORMAT);

    if(fifoFormat == DBI_FIFO_888_NBGR || fifoFormat == DBI_FIFO_888_NRGB){
        wordCount = PixelCount;
    }else if(fifoFormat == DBI_FIFO_565_BGRBGR || fifoFormat == DBI_FIFO_565_RGBRGB){
        wordCount = (PixelCount + 1) >> 1;
    }else{
        wordCount = (PixelCount * 3 + 3) >> 2;
    }
    return wordCount;
}

/****************************************************************************/ /**
 * @brief  DBI send Command and write normal-data function
 *
 * @param  command: Command to send (if command phase enable)
 * @param  dataSize: write size of NormalData (write max 4)
 * @param  dataBuff: buff of NormalData
 * @return None
 *
*******************************************************************************/
void DBI_SendCmdWithNormalData(uint8_t command, uint8_t dataSize, uint8_t *dataBuff)
{
    /* disable transfer */
    DBI_Disable();

    /* clear fifo and interrupt */
    DBI_IntClear();

    /* set command */
    DBI_SetCommand(command);

    /* set data direction */
    DBI_SetNormalDataDir(DBI_DATA_WRITE);

    /* Data type select, and set data count */
    DBI_SetDataTypeAndCount(DBI_DATA_NORMAL, dataSize);

    /* Fill the data into the register */
    DBI_WriteNormlData(dataSize, dataBuff);

    /* enable transfer */
    DBI_Enable();

    /* Wait transfer end */
    while (DBI_GetIntStatus(DBI_INT_END) != SET) {
    }

    /* clear interrupt */
    DBI_IntClear();
}

/****************************************************************************/ /**
 * @brief  DBI send Command and read normal-data function
 *
 * @param  command: Command to send (if command phase enable)
 * @param  dataSize: read size of NormalData (read max 4 )
 * @param  dataBuff: buff of NormalData
 * @return None
 *
*******************************************************************************/
void DBI_SendCmdAndReadNormalData(uint8_t command, uint8_t dataSize, uint8_t *dataBuff)
{
    /* disable transfer */
    DBI_Disable();

    /* clear interrupt */
    DBI_IntClear();

    /* set command */
    DBI_SetCommand(command);

    /* set data direction */
    DBI_SetNormalDataDir(DBI_DATA_READ);

    /* Data type select, and set data count */
    DBI_SetDataTypeAndCount(DBI_DATA_NORMAL, dataSize);

    /* enable transfer */
    DBI_Enable();

    /* Wait transfer end */
    while (DBI_GetIntStatus(DBI_INT_END) != SET) {
    }

    /* get data */
    DBI_ReadNormlData(dataSize, dataBuff);

    /* clear interrupt */
    DBI_IntClear();
}

/****************************************************************************/ /**
 * @brief  DBI send Command and write pixel-data function
 *
 * @param  command: Command to send (if command phase enable)
 * @param  dataSize: write size of Pixel-Data
 * @param  dataBuff: buff of Pixel-Data
 * @return None
 *
*******************************************************************************/
void DBI_SendCmdWithPixelData(uint8_t command, int32_t PixelCount, uint32_t *pixelBuff)
{
    /* disable transfer */
    DBI_Disable();

    /* clear fifo and interrupt */
    DBI_TxFifoClear();
    DBI_IntClear();

    /* set command */
    DBI_SetCommand(command);

    /* set data direction */
    DBI_SetNormalDataDir(DBI_DATA_WRITE);

    /* Data type select, and set data count */
    DBI_SetDataTypeAndCount(DBI_DATA_PIXEL, PixelCount);

    /* enable transfer */
    DBI_Enable();

    /* get words count */
    uint32_t wordsCount = DBI_GetWordCountOfPixelData(PixelCount);
    /* send data */
    DBI_WirteData2FIFO(wordsCount, pixelBuff);

    /* Wait transfer end */
    while (DBI_GetIntStatus(DBI_INT_END) != SET) {
    }

    /* clear interrupt */
    DBI_IntClear();
}

/****************************************************************************/ /**
 * @brief  Clear tx fifo,overflow/underflow flag and fifo error interrupt will be cleared
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void DBI_TxFifoClear(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DBI_BASE, DBI_FIFO_CONFIG_0);
    tmpVal = BL_SET_REG_BIT(tmpVal, DBI_TX_FIFO_CLR);
    BL_WR_REG(DBI_BASE, DBI_FIFO_CONFIG_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Enable or disable signal of dma interface
 *
 * @param  dmaEn: Enable or disable
 *
 * @return None
 *
*******************************************************************************/
void DBI_SetDMA(BL_Fun_Type dmaEn)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DBI_BASE, DBI_FIFO_CONFIG_0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_DMA_TX_EN, dmaEn);
    BL_WR_REG(DBI_BASE, DBI_FIFO_CONFIG_0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Set tx fifo threshold
 *
 * @param  threshold: Threshold value
 *
 * @return None
 *
*******************************************************************************/
void DBI_SetTxFifoThreshold(uint8_t threshold)
{
    uint32_t tmpVal;

