RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dbi.c
    tmpVal = BL_RD_REG(DBI_BASE, DBI_FIFO_CONFIG_1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_TX_FIFO_TH, threshold);
    BL_WR_REG(DBI_BASE, DBI_FIFO_CONFIG_1, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Get tx fifo count value
 *
 * @param  None
 *
 * @return Count value
 *
*******************************************************************************/
uint8_t DBI_GetTxFifoCount(void)
{
    return BL_GET_REG_BITS_VAL(BL_RD_REG(DBI_BASE, DBI_FIFO_CONFIG_1), DBI_TX_FIFO_CNT);
}

/****************************************************************************/ /**
 * @brief  Get interrupt status
 *
 * @param  intType: DBI interrupt type
 *
 * @return Status of interrupt
 *
*******************************************************************************/
BL_Sts_Type DBI_GetIntStatus(DBI_INT_Type intType)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DBI_BASE, DBI_INT_STS);

    if ((tmpVal >> intType & 1) == 1) {
        return SET;
    } else {
        return RESET;
    }
}

/****************************************************************************/ /**
 * @brief  Get tx fifo overflow/underflow status
 *
 * @param  overflow: Select overflow or underflow
 *
 * @return Status of tx fifo
 *
*******************************************************************************/
BL_Sts_Type DBI_GetOverflowStatus(DBI_Overflow_Type overflow)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_DBI_OVERFLOW_TYPE(overflow));

    tmpVal = BL_RD_REG(DBI_BASE, DBI_FIFO_CONFIG_0);

    if (overflow == DBI_TX_OVERFLOW) {
        if (BL_IS_REG_BIT_SET(tmpVal, DBI_TX_FIFO_OVERFLOW)) {
            return SET;
        } else {
            return RESET;
        }
    } else {
        if (BL_IS_REG_BIT_SET(tmpVal, DBI_TX_FIFO_UNDERFLOW)) {
            return SET;
        } else {
            return RESET;
        }
    }
}

/****************************************************************************/ /**
 * @brief  Get DBI bus busy status
 *
 * @param  None
 *
 * @return Status of DBI bus
 *
*******************************************************************************/
BL_Sts_Type DBI_GetBusBusyStatus(void)
{
    if (BL_IS_REG_BIT_SET(BL_RD_REG(DBI_BASE, DBI_BUS_BUSY), DBI_STS_DBI_BUS_BUSY)) {
        return SET;
    } else {
        return RESET;
    }
}

/****************************************************************************/ /**
 * @brief  Mask/Unmask the DBI interrupt
 *
 * @param  intType: DBI interrupt type
 * @param  intMask: Mask/Unmask
 *
 * @return None
 *
*******************************************************************************/
void DBI_IntMask(DBI_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_DBI_INT_TYPE(intType));

    tmpVal = BL_RD_REG(DBI_BASE, DBI_INT_STS);

    switch (intType) {
        case DBI_INT_END:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_END_MASK, intMask);
            break;

        case DBI_INT_TX_FIFO_REQ:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_TXF_MASK, intMask);
            break;

        case DBI_INT_FIFO_ERR:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_FER_MASK, intMask);
            break;

        case DBI_INT_ALL:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_END_MASK, intMask);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_TXF_MASK, intMask);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DBI_CR_DBI_FER_MASK, intMask);
            break;

        default:
            break;
    }

    BL_WR_REG(DBI_BASE, DBI_INT_STS, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Clear DBI interrupt
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void DBI_IntClear(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DBI_BASE, DBI_INT_STS);
    BL_WR_REG(DBI_BASE, DBI_INT_STS, BL_SET_REG_BIT(tmpVal, DBI_CR_DBI_END_CLR));
}

/****************************************************************************/ /**
 * @brief  Install DBI interrupt callback function
 *
 * @param  intType: DBI interrupt type
 * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DBI_Int_Callback_Install(DBI_INT_Type intType, intCallback_Type *cbFun)
{
    /* Check the parameters */
    CHECK_PARAM(IS_DBI_INT_TYPE(intType));

    DBIIntCbfArra[intType] = cbFun;
}
#endif

/*@} end of group DBI_Public_Functions */

/*@} end of group DBI */

/*@} end of group BL808_Peripheral_Driver */
